In [1]:
import pandas as pd

In [2]:
pd.Series(['Male','Female','Male','Male','Female','Female','Female'])

0      Male
1    Female
2      Male
3      Male
4    Female
5    Female
6    Female
dtype: object

In [3]:
ser = pd.Series(['Male','Female','Male','Male','Female','Female','Female'])

In [4]:
type(ser)

pandas.core.series.Series

In [5]:
dict_data = {'a':1, 'b':2, 'c':3}

In [6]:
pd.Series(dict_data)

a    1
b    2
c    3
dtype: int64

In [7]:
ser1 = pd.Series(dict_data)

In [8]:
type(ser1)

pandas.core.series.Series

In [9]:
ser1.index

Index(['a', 'b', 'c'], dtype='object')

In [14]:
ser1.values

array([1, 2, 3])

In [15]:
list_data = ['2019-01-02', 3.14, 'ABC', 100, True]

In [16]:
ser2 = pd.Series(list_data)

In [17]:
ser2

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [18]:
ser2.index

RangeIndex(start=0, stop=5, step=1)

In [20]:
pd.DataFrame({
    'Name': ["Braund, Mr. Owen Harris", 
             "Allen, Mr. William Henry",
             "Bonnell, Miss. Elizabeth"
             ],
    'Age':[22, 35,58],
    "Sex":["male", "male", "female"]
})

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [21]:
df = pd.DataFrame({
    'Name': ["Braund, Mr. Owen Harris", 
             "Allen, Mr. William Henry",
             "Bonnell, Miss. Elizabeth"
             ],
    'Age':[22, 35,58],
    "Sex":["male", "male", "female"]
})

In [22]:
df['Age']

0    22
1    35
2    58
Name: Age, dtype: int64

In [23]:
type(df['Age'])

pandas.core.series.Series

In [24]:
df['Age'][0]

22

In [25]:
df = pd.DataFrame([[1,2,3],
                   [4,5,6],
                   [7,8,9]])

In [26]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [27]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [28]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [29]:
df[0]

0    1
1    4
2    7
Name: 0, dtype: int64

In [30]:
type(df[0])

pandas.core.series.Series

In [31]:
eye = pd.Series({'Brown':220, 'Blue':215, 'Hazel':93, 'Green':64})

In [32]:
eye.index

Index(['Brown', 'Blue', 'Hazel', 'Green'], dtype='object')

In [33]:
type(eye)

pandas.core.series.Series

In [34]:
eye.name

In [35]:
eye.name = 'eye_color'

In [36]:
eye

Brown    220
Blue     215
Hazel     93
Green     64
Name: eye_color, dtype: int64

In [40]:
df = pd.DataFrame({
    'Name': ["Braund, Mr. Owen Harris", 
             "Allen, Mr. William Henry",
             "Bonnell, Miss. Elizabeth"
             ],
    'Age':[22, 35,58],
    "Sex":["male", "male", "female"]
})

In [41]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [43]:
df.loc[0]

Name    Braund, Mr. Owen Harris
Age                          22
Sex                        male
Name: 0, dtype: object

In [44]:
eye.name

'eye_color'

In [45]:
eye.index

Index(['Brown', 'Blue', 'Hazel', 'Green'], dtype='object')

In [46]:
eye.values

array([220, 215,  93,  64])

In [47]:
eye.sort_values()

Green     64
Hazel     93
Blue     215
Brown    220
Name: eye_color, dtype: int64

In [48]:
eye.sort_values(ascending=False)

Brown    220
Blue     215
Hazel     93
Green     64
Name: eye_color, dtype: int64

In [49]:
eye.sort_index()

Blue     215
Brown    220
Green     64
Hazel     93
Name: eye_color, dtype: int64

In [50]:
eye.sort_index(ascending=False)

Hazel     93
Green     64
Brown    220
Blue     215
Name: eye_color, dtype: int64

In [51]:
eye.unique()

array([220, 215,  93,  64])

In [52]:
eye.nunique()

4

In [53]:
for valor in eye.unique():
    print(valor)

220
215
93
64

In [54]:
my_data2 = [220, 215, 93, 64, 64]

In [55]:
eye2 = pd.Series(data=my_data2,
                 index=['Brown', 'Blue', 'Blue', 'Hazel', 'Green'])

In [56]:
eye2

Brown    220
Blue     215
Blue      93
Hazel     64
Green     64
dtype: int64

In [57]:
eye2.unique()

array([220, 215,  93,  64])

In [58]:
eye2.nunique()

4

In [59]:
eye2.value_counts()

64     2
220    1
215    1
93     1
Name: count, dtype: int64

In [61]:
ser = pd.Series([0,10,20,30,40], index=['a','b','c','d','e'])

In [62]:
ser

a     0
b    10
c    20
d    30
e    40
dtype: int64

In [63]:
ser[1]

/var/folders/wd/8t2cjvkx45qdh6rl82cn9h040000gn/T/ipykernel_2757/4267038266.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[1]

10

In [64]:
ser['b']

10

In [65]:
ser[1:3]

b    10
c    20
dtype: int64

In [66]:
ser1 = pd.Series([0,1,2,3,4], index=[0,1,2,3,4])
ser2 = pd.Series([0,1,2,3,4], index=[4,3,2,1,0])

In [67]:
ser1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [68]:
ser2

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [69]:
ser1+ser2

0    4
1    4
2    4
3    4
4    4
dtype: int64

In [70]:
ser1*ser2

0    0
1    3
2    4
3    3
4    0
dtype: int64

In [71]:
ser1/ser2

0    0.000000
1    0.333333
2    1.000000
3    3.000000
4         inf
dtype: float64

In [72]:
ser1.sum()

10

In [73]:
ser1.mean()

2.0

In [75]:
ser1.median()

2.0

In [76]:
ser1.max()

4

In [77]:
ser1.min()

0

In [78]:
ser1.std()

1.5811388300841898

In [79]:
ser1.sort_values()

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [ ]:
def function(a,b):
    return a+b

In [ ]:
lambda a,b: a+b

In [81]:
ser_height = pd.Series([160,170,180],name='height')

In [82]:
plus_10 = lambda x:x+10

In [83]:
plus_10(5)

15

In [85]:
ser_height.apply(lambda x:x+10)

0    170
1    180
2    190
Name: height, dtype: int64

In [86]:
print('Hola\nHola2\n\tHola3')

Hola
Hola2
	Hola3

Cambiamos a Pandas (slide 186)

In [87]:
pd.read_csv('data_iris.csv')

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [88]:
iris = pd.read_csv('data_iris.csv')

In [89]:
type(iris)

pandas.core.frame.DataFrame

In [90]:
data = {'NAME':['Jake','Jennifer','Paul','Andrew'],
        'AGE':[24,21,25,19],
        'GENDER':['M','F','M','M']}

In [91]:
pd.DataFrame(data)

       NAME  AGE GENDER
0      Jake   24      M
1  Jennifer   21      F
2      Paul   25      M
3    Andrew   19      M

In [92]:
df = pd.DataFrame(data)

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    4 non-null      object
 1   AGE     4 non-null      int64
 2   GENDER  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [94]:
df

       NAME  AGE GENDER
0      Jake   24      M
1  Jennifer   21      F
2      Paul   25      M
3    Andrew   19      M

In [96]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [98]:
iris.head(20)

    Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0            5.1          3.5           1.4          0.2  setosa
1            4.9          3.0           1.4          0.2  setosa
2            4.7          3.2           1.3          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
4            5.0          3.6           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
6            4.6          3.4           1.4          0.3  setosa
7            5.0          3.4           1.5          0.2  setosa
8            4.4          2.9           1.4          0.2  setosa
9            4.9          3.1           1.5          0.1  setosa
10           5.4          3.7           1.5          0.2  setosa
11           4.8          3.4           1.6          0.2  setosa
12           4.8          3.0           1.4          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
16           5.4          3.9           1.3          0.4  setosa
17           5.1          3.5           1.4          0.3  setosa
18           5.7          3.8           1.7          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa

In [99]:
iris.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [100]:
iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [101]:
iris.index

RangeIndex(start=0, stop=150, step=1)

In [102]:
iris.columns = ['Sepal_Length', 'Sepal_Width', 'Petal_Length', 'Petal_Width', 'Species']

In [103]:
iris

     Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [104]:
iris.Sepal_Length

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal_Length, Length: 150, dtype: float64

In [105]:
iris['Sepal_Length']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal_Length, Length: 150, dtype: float64

In [106]:
iris[['Sepal_Length','Sepal_Width']]

     Sepal_Length  Sepal_Width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

In [107]:
df = pd.DataFrame([['Name', 'Age', 'Sex', 'School'],
                   ['Tom',15,'Male','middle'],
                   ['Alice',10,'Female','elementary']
                   ])

In [108]:
df

       0    1       2           3
0   Name  Age     Sex      School
1    Tom   15    Male      middle
2  Alice   10  Female  elementary

In [109]:
df = pd.DataFrame([['Tom',15,'Male','middle'],
                   ['Alice',10,'Female','elementary']
                   ],
                   columns=['Name', 'Age', 'Sex', 'School'])

In [110]:
df

    Name  Age     Sex      School
0    Tom   15    Male      middle
1  Alice   10  Female  elementary

In [111]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [112]:
df.index = ['stu1','stu2']

In [113]:
df

       Name  Age     Sex      School
stu1    Tom   15    Male      middle
stu2  Alice   10  Female  elementary

In [114]:
df.index

Index(['stu1', 'stu2'], dtype='object')

In [115]:
df.columns = ['student_name','years','sex2','school2']

In [116]:
df

     student_name  years    sex2     school2
stu1          Tom     15    Male      middle
stu2        Alice     10  Female  elementary

In [117]:
df.rename(index={'stu1':'student1'})

         student_name  years    sex2     school2
student1          Tom     15    Male      middle
stu2            Alice     10  Female  elementary

In [118]:
df

     student_name  years    sex2     school2
stu1          Tom     15    Male      middle
stu2        Alice     10  Female  elementary

In [119]:
df.rename(index={'stu1':'student1'}, inplace=True)

In [120]:
df

         student_name  years    sex2     school2
student1          Tom     15    Male      middle
stu2            Alice     10  Female  elementary

In [121]:
df.rename(index={'stu2':'student2'})

         student_name  years    sex2     school2
student1          Tom     15    Male      middle
student2        Alice     10  Female  elementary

In [122]:
df = df.rename(index={'stu2':'student2'})

In [123]:
df

         student_name  years    sex2     school2
student1          Tom     15    Male      middle
student2        Alice     10  Female  elementary

In [124]:
df.rename(columns={'student_name':'stu_name'}, inplace=True)

In [125]:
df

         stu_name  years    sex2     school2
student1      Tom     15    Male      middle
student2    Alice     10  Female  elementary